
// Функция возвращает результат сравнения двух семантических версий
//
// Параметры:
//   Версия1 - Строка - Версия для сравнения 
//   Версия2 - Строка - Версия для сравнения
//   ВариантРасчета - Число - выбор варианта сравнения: 0 - встроенной функцией, 1 - простро на равно, 2 - посимвольно; значение по-умолчанию 0
//
// Возвращаемое значение:
//   Число - результат, если версии равны то он равен 0, если Версия1 > Версия2 тогда -1, если Версия1 < Версия2 тогда 1
//
Функция Сравнить(Версия1, Версия2, ВариантРасчета=0) Экспорт
	
	Результат = 0;
	Если ВариантРасчета = 0 Тогда
		Результат = (-1) * СтрСравнить(Версия1, Версия2);
	ИначеЕсли ВариантРасчета = 1 Тогда
		Если Версия1 <> Версия2 Тогда
			СтаршаяВерсия = Макс(Версия1, Версия2);
			Если СтаршаяВерсия = Версия1 Тогда
				Результат = -1;
			Иначе//Если СтаршаяВерсия = Версия2 Тогда
				Результат = 1;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВариантРасчета = 2 Тогда
		Для Позиция = 1 По Макс(СтрДлина(Версия1),СтрДлина(Версия2)) Цикл
			СимволВерсия1 = Сред(Версия1, Позиция, 1);
			СимволВерсия2 = Сред(Версия2, Позиция, 1);
			Если ЗначениеЗаполнено(СимволВерсия1) И ЗначениеЗаполнено(СимволВерсия2) Тогда
				Если Сред(Версия1, Позиция, 1) > Сред(Версия2, Позиция, 1) Тогда
					Результат = -1;
				ИначеЕсли Сред(Версия2, Позиция, 1) > Сред(Версия1, Позиция, 1) Тогда
					Результат = 1;
				Иначе 
					Результат = 0;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(СимволВерсия1) Тогда
				//у Версия2 меньше символов
				Результат = -1;
				Прервать;
			ИначеЕсли ЗначениеЗаполнено(СимволВерсия2) Тогда
				//у Версия1 меньше символов
				Результат = 1;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции