
&НаКлиенте
Процедура Сравнить(Команда)
	СравнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СравнитьНаСервере()
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	НоваяСтрока = ЭтотОбъект.ТаблицаСравнений.Добавить();
	НоваяСтрока.Версия1 = ЭтотОбъект.Версия1;
	НоваяСтрока.Версия2 = ЭтотОбъект.Версия2;
	НоваяСтрока.Результат = ОбъектФормы.Сравнить(ЭтотОбъект.Версия1, ЭтотОбъект.Версия2, ЭтотОбъект.ВариантСравнения); 
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ЭтотОбъект.ТаблицаСравнений.Очистить();
КонецПроцедуры
